app/controllers/api/v1/playlist_tracks_controller.rb

SELECT "tracks".* FROM "tracks"
SELECT "playlist_tracks".* FROM "playlist_tracks"
---
    def index
      @playlist_tracks = PlaylistTrack.all

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."spotify_id" = $1 LIMIT $2  [["spotify_id", "46IZ0fSY2mpAiktS3KOqds"], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "tracks" ("name", "artists", "image", "duration", "popularity", "preview", "spotify_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "playlist_tracks" ("track_id", "playlist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["track_id", 11], ["playlist_id", 10], ["created_at", "2021-12-10 18:57:04.224676"], ["updated_at", "2021-12-10 18:57:04.224676"]]
---
    def create
      track = Track.find_by(spotify_id: params[:spotify_id])
      if !track
        s_track = RSpotify::Track.find(params[:spotify_id])
        track = Track.create_from_spotify_track(s_track)
      end

      @playlist_track = PlaylistTrack.create(playlist_id: playlist_track_params[:playlist_id], track_id: track.id)