app/controllers/api/v1/playlists_controller.rb

INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New"], ["user_id", 12], ["created_at", "2021-12-10 18:56:53.568281"], ["updated_at", "2021-12-10 18:56:53.568281"]]
---
  def create
    @playlist = Playlist.create(playlist_params)