app/controllers/api/v1/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
SELECT "playlists".* FROM "playlists"
---
  def top_100
    # top 50 playlist for 2021 tracks
    # https://open.spotify.com/playlist/37i9dQZEVXbNG2KDcFcKOF
    s_tracks = RSpotify::Playlist.find("spotify","37i9dQZEVXbNG2KDcFcKOF").tracks
    @tracks = s_tracks.map do |s_track|